{
  "backend/main.mo": "Actor defines an Inquiry type and stores submitted inquiries in a list with validation and timestamping.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short summaries of their purpose and behavior.",
  "frontend/index.css": "Tailwind base and utility layers plus theme variables for light and dark modes using OKLCH values.",
  "frontend/index.html": "HTML entry point setting meta tags, loading Inter font, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in a React Query provider.",
  "frontend/src/components/ContactForm.tsx": "Form component with validation, success/error states, and backend submission via useSubmitInquiry.",
  "frontend/src/components/CourseSection.tsx": "Displays course info with benefits list and CTA buttons linking to contact, phone, and WhatsApp.",
  "frontend/src/components/FeatureCard.tsx": "Feature display card with icon, title, description, and hover styling.",
  "frontend/src/components/GoogleMapEmbed.tsx": "Lazy‑loads a Google Maps iframe when scrolled into view using IntersectionObserver.",
  "frontend/src/components/MarketingSection.tsx": "Simple wrapper component providing consistent section spacing and container layout.",
  "frontend/src/components/SiteFooter.tsx": "Footer with logo, quick links, contact info, and social media buttons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, desktop navigation, and a mobile slide-out menu.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper providing header, footer, main content area, and a sticky WhatsApp button.",
  "frontend/src/components/StickyWhatsAppButton.tsx": "Floating WhatsApp action button linking to a predefined chat URL.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Mutation hook to submit contact inquiries via the backend actor and refresh inquiry data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theming variables, global styles, and custom scrollbar styles.",
  "frontend/src/lib/contactLinks.ts": "Utility functions generating tel, WhatsApp, and email links using predefined contact info.",
  "frontend/src/lib/seo.ts": "Simple helper for updating the document title and meta description.",
  "frontend/src/main.tsx": "App entrypoint initializing React, query client, Internet Identity, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "About page with meta tags and multiple marketing sections describing mission, vision, and methodology.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with meta tags, contact details, form, and an embedded Google Map.",
  "frontend/src/pages/CoursesPage.tsx": "Renders the courses page with SEO metadata, marketing sections, and detailed course offerings for board and competitive exams.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, SEO metadata, promotional sections, and feature highlights.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, animations, and plugin settings for the frontend.",
  "project_state.json": "Describes project metadata and requests, including a pending feature to add social media buttons to the footer."
}